
brew "openssl"
brew "coreutils"
brew "autoconf"
brew "automake"
brew "gdbm"
brew "libtool"
brew "libyaml"
brew "pkg-config"
brew "readline"
brew "xz"

brew "curl"
brew "git"
brew "lua"
brew "perl"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python" # dep of vim, we'll be using pyenv
brew "ruby"
brew "sqlite"
brew "stow"
brew "tree"
brew "vim"

tap "homebrew/cask-fonts"

# This cask doesn't have a sha256, let's fix this so we can install this with homebrew after setting --require-sha
# cask "font-dejavu-sans-mono-for-powerline"
# We use meslo for now
cask "alacritty"
cask "discord"
cask "firefox"
cask "font-hack-nerd-font"
cask "font-meslo-for-powerline"
cask "google-chrome"
cask "iterm2"
cask "keepassxc"
cask "sequel-pro"
cask "spotify"
cask "tresorit"
cask "vlc"
