
brew "openssl"
brew "coreutils"
brew "autoconf"
brew "automake"
brew "gdbm"
brew "libtool"
brew "libyaml"
brew "pkg-config"
brew "readline"
brew "xz"

brew "curl"
brew "git"
brew "go"
brew "lua"
brew "mas"
brew "node"
brew "perl"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python" # dep of vim, we'll be using pyenv
brew "ranger"
brew "ripgrep"
brew "ruby"
brew "sqlite"
brew "stow"
brew "tree"
brew "vim"
brew "weechat"
brew "yarn"

tap "homebrew/cask-fonts"

# This cask doesn't have a sha256, let's fix this so we can install this with homebrew after setting --require-sha
# cask "font-dejavu-sans-mono-for-powerline"
# We use meslo for now
cask "alacritty"
cask "discord"
cask "docker"
cask "figma"
cask "firefox"
cask "font-hack-nerd-font"
cask "font-meslo-for-powerline"
cask "google-chrome"
cask "iterm2"
cask "sequel-pro"
cask "signal"
cask "spotify"
cask "telegram"
cask "tresorit"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"

mas "1Password 7 - Password Manager", id: 1333542190
mas "Affinity Designer", id: 824171161
